; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-69)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc7)
    (at car1 loc7)
    (at car2 loc4)
    (at car3 loc10)
    (at car4 loc3)
    (at car5 loc4)
    (at car6 loc4)
    (at car7 loc3)
    (at car8 loc2)
    (at car9 loc5)
    (at car10 loc12)
    (at car11 loc7)
    (at car12 loc9)
    (at car13 loc11)
)
 (:goal (and 
(at car1 loc10)
(at car2 loc2)
(at car3 loc11)
(at car4 loc9)
(at car5 loc5)
(at car6 loc8)
(at car7 loc11)
(at car8 loc11)
))
)

; plan
1. (board car1 loc7)
   deleted: (at car1 loc7) (empty-ferry)
   added: (on car1)
   goals met: 0 of 8
2. (sail loc7 loc10)
   deleted: (at-ferry loc7)
   added: (at-ferry loc10)
   goals met: 0 of 8
3. (debark car1 loc10)
   deleted: (on car1)
   added: (at car1 loc10) (empty-ferry)
   goals met: 1 of 8
4. (board car3 loc10)
   deleted: (at car3 loc10) (empty-ferry)
   added: (on car3)
   goals met: 1 of 8
5. (sail loc10 loc11)
   deleted: (at-ferry loc10)
   added: (at-ferry loc11)
   goals met: 1 of 8
6. (debark car3 loc11)
   deleted: (on car3)
   added: (at car3 loc11) (empty-ferry)
   goals met: 2 of 8
7. (sail loc11 loc4)
   deleted: (at-ferry loc11)
   added: (at-ferry loc4)
   goals met: 2 of 8
8. (board car5 loc4)
   deleted: (at car5 loc4) (empty-ferry)
   added: (on car5)
   goals met: 2 of 8
9. (sail loc4 loc5)
   deleted: (at-ferry loc4)
   added: (at-ferry loc5)
   goals met: 2 of 8
10. (debark car5 loc5)
   deleted: (on car5)
   added: (at car5 loc5) (empty-ferry)
   goals met: 3 of 8
11. (sail loc5 loc4)
   deleted: (at-ferry loc5)
   added: (at-ferry loc4)
   goals met: 3 of 8
12. (board car6 loc4)
   deleted: (at car6 loc4) (empty-ferry)
   added: (on car6)
   goals met: 3 of 8
13. (sail loc4 loc8)
   deleted: (at-ferry loc4)
   added: (at-ferry loc8)
   goals met: 3 of 8
14. (debark car6 loc8)
   deleted: (on car6)
   added: (at car6 loc8) (empty-ferry)
   goals met: 4 of 8
15. (sail loc8 loc3)
   deleted: (at-ferry loc8)
   added: (at-ferry loc3)
   goals met: 4 of 8
16. (board car4 loc3)
   deleted: (at car4 loc3) (empty-ferry)
   added: (on car4)
   goals met: 4 of 8
17. (sail loc3 loc9)
   deleted: (at-ferry loc3)
   added: (at-ferry loc9)
   goals met: 4 of 8
18. (debark car4 loc9)
   deleted: (on car4)
   added: (at car4 loc9) (empty-ferry)
   goals met: 5 of 8
19. (sail loc9 loc4)
   deleted: (at-ferry loc9)
   added: (at-ferry loc4)
   goals met: 5 of 8
20. (board car2 loc4)
   deleted: (at car2 loc4) (empty-ferry)
   added: (on car2)
   goals met: 5 of 8
21. (sail loc4 loc2)
   deleted: (at-ferry loc4)
   added: (at-ferry loc2)
   goals met: 5 of 8
22. (debark car2 loc2)
   deleted: (on car2)
   added: (at car2 loc2) (empty-ferry)
   goals met: 6 of 8
23. (board car8 loc2)
   deleted: (at car8 loc2) (empty-ferry)
   added: (on car8)
   goals met: 6 of 8
24. (sail loc2 loc11)
   deleted: (at-ferry loc2)
   added: (at-ferry loc11)
   goals met: 6 of 8
25. (debark car8 loc11)
   deleted: (on car8)
   added: (at car8 loc11) (empty-ferry)
   goals met: 7 of 8
26. (sail loc11 loc3)
   deleted: (at-ferry loc11)
   added: (at-ferry loc3)
   goals met: 7 of 8
27. (board car7 loc3)
   deleted: (at car7 loc3) (empty-ferry)
   added: (on car7)
   goals met: 7 of 8
28. (sail loc3 loc11)
   deleted: (at-ferry loc3)
   added: (at-ferry loc11)
   goals met: 7 of 8
29. (debark car7 loc11)
   deleted: (on car7)
   added: (at car7 loc11) (empty-ferry)
   goals met: 8 of 8
